8evgeny/GIT/5_Amplifier_UM_300/UM_2_MILANDR/MDR1986BExx/2.0.3/IDE/Keil/SVD/MDR32Fx/MDR1901VC1.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="MDR_SSP1">
            <name>MDR_SSP2</name>
            <description>SSP2</description>
            <groupName>SSP</groupName>
            <prependToName>MDR_SSP2_</prependToName>
            <baseAddress>0x400A0000</baseAddress>
            <interrupt>
                <name>SSP2_IRQ</name>
                <value>20</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="MDR_SSP1">
            <name>MDR_SSP3</name>
            <description>SSP3</description>
            <groupName>SSP</groupName>
            <prependToName>MDR_SSP3_</prependToName>
            <baseAddress>0x40000000</baseAddress>
            <interrupt>
                <name>SSP3_IRQ</name>
                <value>0</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="MDR_SSP1">
            <name>MDR_SSP4</name>
            <description>SSP4</description>
            <groupName>SSP</groupName>
            <prependToName>MDR_SSP4_</prependToName>
            <baseAddress>0x40008000</baseAddress>
            <interrupt>
                <name>SSP4_IRQ</name>
                <value>1</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>MDR_SDIO</name>
            <version>1.0</version>
            <description>SDIO Controller</description>
            <groupName>SDIO</groupName>
            <prependToName>MDR_SDIO_</prependToName>
            <baseAddress>0x40048000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x2C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>SDIO_IRQ</name>
                <value>18</value>
            </interrupt>
            <registers>
                <register>
                    <name>CR</name>
                    <description>SDIO Control Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SDE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIRCMD</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIRDAT</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WORK1</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBITCMD</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBITDAT</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BR2_BR0</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CRCEN_DAT</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CRCEN_CMD</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXEIE_DAT</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXNEIE_DAT</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXFIE_DAT</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXEIE_CMD</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXNEIE_CMD</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXFIE_CMD</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WIDTHDAT</name>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WRITECMD</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENDBUSY</name>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WORK2</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKOE</name>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <description>SDIO Status Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000000F</resetMask>
                    <fields>
                        <field>
                            <name>FIFOCMD_EMPTY</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FIFODAT_EMPTY</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FIFOCMD_FULL</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FIFODAT_FULL</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDDR</name>
                    <description>SDIO Command Data Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RX_FIFO_TX_FIFO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATDR</name>
                    <description>SDIO Data Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RX_FIFO_TX_FIFO</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDCRC</name>
                    <description>SDIO Command CRC Register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000007F</resetMask>
                    <fields>
                        <field>
                            <name>CMDCRC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAT0CRC</name>
                    <description>SDIO Data0 CRC Register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000FFFF</resetMask>
                    <fields>
                        <field>
                            <name>DAT0CRC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAT1CRC</name>
                    <description>SDIO Data1 CRC Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000FFFF</resetMask>
                    <fields>
                        <field>
                            <name>DAT1CRC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAT2CRC</name>
                    <description>SDIO Data2 CRC Register</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000FFFF</resetMask>
                    <fields>
                        <field>
                            <name>DAT2CRC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAT3CRC</name>
                    <description>SDIO Data3 CRC Register</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000FFFF</resetMask>
                    <fields>
                        <field>
                            <name>DAT3CRC</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMDTransfer</name>
                    <description>SDIO Command Transfer Register</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000FFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMDtransfer</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATtransfer</name>
                    <description>SDIO Data Transfer Register</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000FFFF</resetMask>
                    <fields>
                        <field>
                            <name>DATtransfer</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
